specialists = {
    "Травматология": [
        "Зоргулов Галым Серикович",
        "Усин Ерсин Нурымханбетович"
    ],
    "Гастроэнтерология": [
        "Ахмеджанова Лариса Рафиковна",
        "Конысбекова Алия Анапьяровна",
        "Рахметова Венера Саметовна"
    ],
    "Гепатология": [
        "Конысбекова Алия Анапьяровна",
        "Рахметова Венера Саметовна"
    ],
    "Гинекология": [
        "Стамкулова Актоты Шаймерденовна",
        "Даулыбаева Алия Калиевна",
        "Жантенова Сауле Каирбековна"
    ],
    "Дерматология": [
        "Дунь Анастасия Павловна"
    ],
    "Кардиология": [
        "Жакупова Маржангуль Аманжановна",
        "Лепесова Гульжайна Улгайсыновна",
        "Онгарбаева Айжан Еркиновна",
        "Тургумбаева Жанатгуль Кабидуллиновна",
        "Тулегенова Гульдана Жолдыхановна"
    ],
    "Лечебный массаж": [
        "Тенгебаева Гульнар"
    ],
    "Неврология": [
        "Дауылбаева Дина Ермановна",
        "Джамантаева Ботагоз Даукеновна",
        "Сагындыкова Галина"
    ],
    "Нейрохирургия": [
        "Шпеков Азат Салимович",
        "Садвакасов Аскарбек Турсынбекович",
        "Жарасов Алибек Маратович"
    ],
    "Общая хирургия": [
        "Каиргалиев Ильяс Темиргалиевич"
    ],
    "Отоларингология": [
        "Оразалинова Сания Утемисовна"
    ],
    "Офтальмология": [
        "Асыкбаева Адель Бахытовна",
        "Мукажанова Айнагуль Сериковна"
    ],
    "Маммология": [
        "Кожиков Марат Климович"
    ],
    "Педиатрия": [
        "Жобалаева Асем Табысовна",
        "Балгабекова Жанар Биржановна"
    ],
    "Проктология": [
        "Сарсенова Роза Тулегеновна"
    ],
    "Пульмонология": [
        "Ким Салтанат Сулейменовна",
        "Корабельникова Янина Юрьевна",
        "Латыпова Наталья Александровна",
        "Мукатова Ирина Юрьевна",
        "Серикова Аурини Сериковна"
    ],
    "Ревматология": [
        "Кожабекова Асель Ерболовна"
    ],
    "Терапия": [
        "Аскарова Алтын Нугмановна",
        "Жакупова Маржангуль Аманжановна",
        "Сатыбекова Айман Амиржановна"
    ],
    "УЗИ": [
        "Аманбекова Ляззат Акановна",
        "Бердибекова Кымбат Нурхановна",
        "Дуйсенбаева Гулжан Зубиновна",
        "Нажмиденова Алия Балтабаевна"
    ],
    "Урология": [
        "Леонтьев Андриан Олегович",
        "Нурпеисов Ерлан Иманмагзамович"
    ],
    "Физиотерапия": [
        "Абенова Камал Галиолловна"
    ],
    "Флебология": [
        "Адылханов Фархад Тасболатович"
    ],
    "Эндокринология": [
        "Киноятова Дана Каиркельсыновна",
        "Галиева Дарина Ерлановна"
    ],
    "Эндоскопия": [
        "Ташимов Ренат Имангалиевич",
        "Кокен Муратбек"
    ]
}
